Revit 2024 API
FilterIntegerRule Properties
The FilterIntegerRule type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
RuleValue
 The user-supplied value against which values from a Revit document will be tested.
See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace